# Assignment : Pandas Basic Assignment

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [6]:
import pandas as pd

# Create a Pandas Series
data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)

# Print the series
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
import pandas as pd

# Create a list containing 10 elements
data_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# Apply pandas.Series function to the list
series = pd.Series(data_list)

# Print the series
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3 - Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [9]:
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female' , 'Male', 'Female']
}

# Create DataFrame
df = pd.DataFrame(data)

# Print the DataFrame
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a 2-dimensional labeled data structure with columns that can hold different types of data. It can be thought of as a table, similar to a spreadsheet or a SQL table. Each column in a DataFrame is a pandas Series. So, in essence, a DataFrame is a collection of Series objects aligned by index.

A Series, on the other hand, is a one-dimensional labeled array capable of holding any data type (integers, strings, floats, Python objects, etc.). It is essentially a single column of data with associated labels, called the index.

Here's an example to illustrate the difference:

In [1]:
import pandas as pd

# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}
df = pd.DataFrame(data)
print("DataFrame:")
print(df)

DataFrame:
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In this example, df is a DataFrame with three columns: 'Name', 'Age', and 'City'. Each column is a Series.

Now, let's create a Series:

In [2]:
# Creating a Series
ages = pd.Series([25, 30, 35, 40], name='Age')
print("\nSeries:")
print(ages)

Series:
0    25
1    30
2    35
3    40
Name: Age, dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans - There are numerous functions available in Pandas for manipulating data in a DataFrame. Some common ones include:

1 - head() and tail(): These functions allow you to view the first or last few rows of your DataFrame, respectively. They are useful for quickly inspecting the structure and content of your data.

In [3]:
# Viewing the first 5 rows of the DataFrame
df.head()

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

2 -

info(): Provides a concise summary of the DataFrame, including the data types of each column and the number of non-null values.

In [4]:
# Getting a summary of the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

3 - 

describe(): Generates descriptive statistics (count, mean, std, min, max, etc.) for numeric columns in the DataFrame.

In [5]:
# Getting descriptive statistics for numeric columns
df.describe()

             Age
count   4.000000
mean   32.500000
std     6.454972
min    25.000000
25%    28.750000
50%    32.500000
75%    36.250000
max    40.000000

4 - 

drop(): Allows you to remove rows or columns from the DataFrame based on labels or index.

In [6]:
# Dropping a column named 'City'
df.drop('City', axis=1, inplace=True)

5 -

fillna(): Fills missing values (NaN) in the DataFrame with specified values.

In [7]:
# Filling missing values with the mean of the column
df.fillna(df.mean(), inplace=True)

/tmp/ipykernel_2945/3961676222.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.fillna(df.mean(), inplace=True)

6-

groupby(): Groups the DataFrame by one or more columns and allows you to perform operations on each group independently.

In [8]:
# Grouping by the 'Age' column and calculating the mean age for each group
df.groupby('Age').mean()

/tmp/ipykernel_2945/776928886.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Age').mean()

Empty DataFrame
Columns: []
Index: [25, 30, 35, 40]

7-

merge(): Combines two DataFrames based on a common column or index.

In [ ]:
# Merging two DataFrames based on a common column 'ID'
merged_df = pd.merge(df1, df2, on='ID')

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?


Among Series, DataFrame, and Panel in pandas, only DataFrame is mutable in nature.

1 DataFrame: Mutable (modifiable). You can add, remove, or modify columns and rows in a DataFrame after it's created.

2 Series: Immutable (unchangeable). Once a Series object is created, you cannot modify its elements. You can, however, create a new Series with modified values.

3 Panel: Panels have been deprecated since pandas version 0.25.0. They were 3-dimensional data structures, and like DataFrames, they were mutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [10]:
import pandas as pd

# Creating multiple Series
names = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
ages = pd.Series([25, 30, 35, 40])
cities = pd.Series(['New York', 'Los Angeles', 'Chicago', 'Houston'])

# Creating a DataFrame using the Series
data = {'Name': names, 'Age': ages, 'City': cities}
df = pd.DataFrame(data)

# Displaying the DataFrame
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston